const data = [
  {
    qst: "남이 베푼 은덕에 대한 고마움을 마음속 깊이 사무치어 잊을 수 없다",
    ans: "각골난망",
  },
  {
    qst: "어떤 일에 몰두하여 조금도 쉴 시간이 없이 밤낮을 가리지 아니함",
    ans: "불철주야",
  },
  {
    qst: "한번만 건드려도 폭발 할 것 같이 몹시 위급한 상태",
    ans: "일촉즉발",
  },
  {
    qst: "여러 해를 거듭하여 계속 이어짐",
    ans: "연년세세",
  },
  {
    qst: "고생을 하면서 부지런하고 꾸준하게 공부하는 자세",
    ans: "형설지공",
  },
  {
    qst: "죽어서까지도 은혜를 잊지 않고 갚음",
    ans: "결초보은",
  },
  {
    qst: "몸과 마음으로 서로 뜻이 통함",
    ans: "이심전심",
  },
  {
    qst: "이러기도 저러기도 어려워 입장이 곤란함",
    ans: "진퇴양난",
  },
  {
    qst: "어찌할 도리가 없어 손을 묶은 듯이 꼼짝 못함",
    ans: "속수무책",
  },
  {
    qst: "말과 행동이 같음",
    ans: "언행일치",
  },
  {
    qst: "고생을 하면서 공부하여 얻은 보상",
    ans: "형설지공",
  },
  {
    qst: "효도를 다 하지 못한 채 어버이를 여읜 자식의 슬픔을 이르는 말",
    ans: "풍수지탄",
  },
  {
    qst: "어떤 일이 일어나기 전에 미리 앞을 내다보고 아는 지혜",
    ans: "선견지명",
  },
  {
    qst: "실패를 거듭하여도 이에 굴하지 않고 계속 도전함",
    ans: "칠전팔기",
  },
  {
    qst: "주인과 손님이 뒤바뀜",
    ans: "주객전도",
  },
  {
    qst: "서로 서로 도움",
    ans: "상부상조",
  },
  {
    qst: "기뻐하다가 슬퍼하다가 함",
    ans: "일희일비",
  },
  {
    qst: "변명할 말이 없거나 변명을 못 함",
    ans: "유구무언",
  },
  {
    qst: "한 가지 일에 몰두하여 두 가지 이득을 얻음",
    ans: "일석이조",
  },
  {
    qst: "난처한 일이나 불행한 일이 잇따라 일어남",
    ans: "설상가상",
  },
  {
    qst: "사회적 지위나 권리에 있어 남자를 여자보다 우대하고 존중하는 일",
    ans: "남존여비",
  },
  {
    qst: "전생에 지은 선악에 따라 현재의 행과 불행이 있는 일",
    ans: "인과응보",
  },
  {
    qst: "모든 일은 반드시 올바르게 돌아갈 것",
    ans: "사필귀정",
  },
  {
    qst: "하찮은 남의 언행도 자신을 수양 하는 데에 도움이 될 수 있음",
    ans: "타산지석",
  },
  {
    qst: "죽은 뒤에라도 은혜를 잊지 않고 갚음을 이르는 말",
    ans: "결초보은",
  },
  {
    qst: "매우 가까운 친구사이",
    ans: "호형호제",
  },
  {
    qst: "눈앞에 보이는 차이만 알고 결과가 같은 것을 모르는 어리석음",
    ans: "조삼모사",
  },
  {
    qst: "용의 머리와 뱀의 꼬리라는 뜻으로, 처음은 왕성하나 끝이 부진한 현상을 이르는 말",
    ans: "용두사미",
  },
  {
    qst: "남에게 입은 은덕을 저버리고 배신하는 태도가 있음",
    ans: "배은망덕",
  },
  {
    qst: "여러 사람이 비참한 지경에 빠져 울부짖는 참상",
    ans: "아비규환",
  },
  {
    qst: "형편에 맞지 않게 겉만 번드르르하게 꾸밈 또는 그런 예절이나 법식",
    ans: "허례허식",
  },
  {
    qst: "어려운 여건 속에도 꿋꿋이 공부함",
    ans: "주경야독",
  },
  {
    qst: "개나 말 정도의 하찮은 힘이라는 뜻 윗사람에게 충성을 다하는 자신의 노력을 낮추어 일컫는 말",
    ans: "견마지로",
  },
  {
    qst: "여러 가지 일도 많고 어려움이나 탈도 많음",
    ans: "다사다난",
  },
  {
    qst: "미리 준비가 되어있으면 걱정할 것이 없음",
    ans: "유비무환",
  },
  {
    qst: "많은 사람들 가운데서 뛰어난 인물을 이르는 말",
    ans: "군계일학",
  },
  {
    qst: "인생의 행복과 불행은 예측하거나 단정하기가 어렵다",
    ans: "새옹지마",
  },
  {
    qst: "세금을 가혹하게 거두어들이고 무리하게 재물을 빼앗음",
    ans: "가렴주구",
  },
  {
    qst: "여러 사람이 서로 자신의 주장을 내세우며 상대편의 주장을 반박함",
    ans: "갑론을박",
  },
  {
    qst: "이성을 사랑하여 간절히 그리워 하는 마음",
    ans: "연모지정",
  },
  {
    qst: "남에게 입은 은혜가 뼈에 새겨질 만큼 커서 잊히지 아니함",
    ans: "각골난망",
  },
  {
    qst: "곧 들이닥칠 바람에 의해 언제 꺼질지 모르는 촛불같이 위대로운 상황을 의미",
    ans: "풍전등화",
  },
  {
    qst: "정신이 아득해져 멍하니 어찌할 줄 모르는 모습을 가리킴",
    ans: "망연자실",
  },
  {
    qst: "자신의 행동을 스스로 조심하고 경계함",
    ans: "자숙자계",
  },
  {
    qst: "결심이 사흘을 가지 못한다는 뜻",
    ans: "작심삼일",
  },
  {
    qst: "융통성이 없고 무식하다 고집이 세다",
    ans: "각주구검",
  },
  {
    qst: "어떤 동기가 있어 이제지 가졌던 마음가짐을 버리고 완전히 달라짐",
    ans: "심기일전",
  },
  {
    qst: "자기 논 앞에 물 대기 라는 뜻으로 자기에게만 유리하게 되도록 생각하거나 행동함",
    ans: "아전인수",
  },
  {
    qst: "고향을 그리워하는 마음",
    ans: "수구초심",
  },
  {
    qst: "어려운 처지에 있는 사람끼리 서로 가엾게 여김",
    ans: "동병상련",
  },
  {
    qst: "주머니 속의 송곳 이라는 뜻으로 재능이 뛰어난 사람은 숨어 있어도 저절로 사람들에게 알려짐을 이르는 말",
    ans: "낭중지추",
  },
  {
    qst: "앞을 내다보는 안목 이라는 뜻 어일이 일어나기 전에 미리 앞을 내다보고 아는 지혜",
    ans: "선견지명",
  },
  {
    qst: "소의 뿔을 바로 잡으려다가 소를 죽인다는 뜻 잘못된 점을 고치려다가 그 방법이나 정도가 지나쳐 오히려 일을 그르침을 이르는 말",
    ans: "교각살우",
  },
  {
    qst: "여러번 실패하여도 굴하지 않고 꾸준히 노력함을 이르는 말",
    ans: "칠전팔기",
  },
  {
    qst: "나날이 다달이 자라거나 발전함",
    ans: "일취월장",
  },
  {
    qst: "지난 시대에는 들어 본 적이 없다는 뜻 이제까지 들어 본 적이 없음",
    ans: "전대미문",
  },
  {
    qst: "동쪽으로 뛰고 서쪽으로 뛴다는 뜻 사방으로 이리저리 몹시 바쁘게 돌아다님을 이르는 말",
    ans: "동분서주",
  },
  {
    qst: "고생을 하면서 부지런하고 꾸준하게 공부하는 자세",
    ans: "형설지공",
  },
  {
    qst: "이를 갈고 마음을 썩이다는 뜻으로 몹시 분하여 이를 갈며 속을 썩임",
    ans: "절치부심",
  },
  {
    qst: "겉으로는 복종하면서 내심으로는 배반함",
    ans: "면종복배",
  },
  {
    qst: "죽은 뒤에라도 은혜를 잊지 않고 갚음",
    ans: "결초보은",
  },
  {
    qst: "양의 머리를 걸어 놓고 개고기를 판다 라는 뜻으로 겉보기만 그럴듯하게 보이고 속은 변변하지 아니함을 이르는 말",
    ans: "양두구육",
  },
  {
    qst: "줏대 없이 남의 의견에 따라 움직임",
    ans: "부화뇌동",
  },
  {
    qst: "알맞은 인재를 알맞은 자리에 씀 또는 그런 자리",
    ans: "적재적소",
  },
  {
    qst: "사람이 보다 나은 방향으로 변하여 전혀 딴 사람처럼 됨",
    ans: "환골탈태",
  },
  {
    qst: "인생이 덧없음",
    ans: "인생무상",
  },
  {
    qst: "모든 생각을 떠나 마음이 빈 상태",
    ans: "무상무념",
  },
  {
    qst: "제자나 후배가 스승이나 선배보다 나음을 비유적으로 이르는 말",
    ans: "청출어람",
  },
  {
    qst: "시기에 늦어 기회를 놓쳤음을 안타까워하는 탄식",
    ans: "만시지탄",
  },
  {
    qst: "인재를 맞아들이기 위하여 참을성 있게 노력함",
    ans: "삼고초려",
  },
  {
    qst: "자나 깨나 잊지 못함",
    ans: "오매불망",
  },
  {
    qst: "정도를 지나침은 미치지 못함과 같다",
    ans: "과유불급",
  },
  {
    qst: "고생 끝에 즐거움이 옴을 이르는 말",
    ans: "고진감래",
  },
  {
    qst: "의형제를 맺음을 이르는 말",
    ans: "도원결의",
  },
  {
    qst: "간사한 꾀로 남을 속여 희롱함을 이르는 말",
    ans: "조삼모사",
  },
  {
    qst: "서로 우열을 가리기 힘든 형세",
    ans: "백중지세",
  },
  {
    qst: "자식이 자란 후에 어버이의 은혜를 갚는 효성을 이르는 말",
    ans: "반포지효",
  },
  {
    qst: "남의 학식이나 재주가 놀랄 만큼 부쩍 늘ㄹ다",
    ans: "괄목상대",
  },
  {
    qst: "좋은일 위에 또 좋은 일이 더하여짐을 비유적으로 이르는 말",
    ans: "금상첨화",
  },
  {
    qst: "자기가 저지른 일은 자기가 해결해야 한다는 뜻",
    ans: "결자해지",
  },
  {
    qst: "잘못하고서 고치지 않는 것이라는 뜻",
    ans: "과이블개",
  },
  {
    qst: "매일 세 번 자신을 반성함",
    ans: "삼성오신",
  },
  {
    qst: "재앙과 근심, 걱정이 바뀌어 오히려 복이 됨",
    ans: "전화위복",
  },
  {
    qst: "같은 사람의 말이나 행동이 앞뒤가 서로 맞지 아니하고 모순됨",
    ans: "자가당착",
  },
  {
    qst: "좋은 옷을 입고 좋은 음식을 먹음",
    ans: "호의호식",
  },
  {
    qst: "더할나위 없이 후회스러움",
    ans: "후회막심",
  },
  {
    qst: "일면의 장점과 다른 일면의 단점을 통틀어 이르는 말",
    ans: "일장일단",
  },
  {
    qst: "아랫사람이나 지위나 학식이 자기만 못한 사람에게 모르는 것을 묻는 일을 부끄러워하지 아니함",
    ans: "불치하문",
  },
  {
    qst: "지식과 행동이 서로 맞음",
    ans: "지행합일",
  },
  {
    qst: "어떤 일이든 끊임없이 노력하면 반드시 이루어짐을 이르는 말",
    ans: "우공이산",
  },
  {
    qst: "이름만 그럴듯하고 실속은 없음",
    ans: "유명무실",
  },
  {
    qst: "달면 삼키고 쓰면 뱉는다는 뜻",
    ans: "감탄고토",
  },
  {
    qst: "가난한 생활을 하면서도 편안한 마음으로 도를 즐겨 지킴",
    ans: "안빈낙도",
  },
  {
    qst: "글자를 한 자도 모를 정도로 무식하다",
    ans: "일자무식",
  },
  {
    qst: "뜻밖에 일어난 큰 변고나 사건을 비유적으로 이르는 말",
    ans: "청천벽력",
  },
  {
    qst: "기운이 다하고 맥이 풀림",
    ans: "기진맥진",
  },
  {
    qst: "상대의 사정과 나의 사정을 자세히 앎",
    ans: "지피지기",
  },
  {
    qst: "같은 무리끼리 서로 사귐",
    ans: "유유상종",
  },
];

export { data };
