const data = [
  {
    qst: "오리가 얼면?",
    ans: "언덕",
    exp: "언(얼은) + 덕(duck, 오리)",
  },
  {
    qst: "우유가 넘어지면?",
    ans: "아야",
    exp: "우유를 90도 회전해서 세로로 봄",
  },
  {
    qst: "아몬드가 죽으면?",
    ans: "다이아몬드",
    exp: "'다이'(die, 죽다) + '아몬드'",
  },
  {
    qst: "세상에서 가장 쉬운 숫자는?",
    ans: "190,000 (십구만)",
    exp: "'십구만'은 '쉽구만'과 발음이 유사",
  },
  {
    qst: "가장 인기있는 벌레는?",
    ans: "스타벅스",
    exp: "'스타'(유명한) + '벅스'(bugs, 벌레들)",
  },
  {
    qst: "차가 울면?",
    ans: "잉카",
    exp: "우는 소리 '잉' + '카'(car, 차)",
  },
  {
    qst: "세상에서 제일 큰 콩은?",
    ans: "홍콩",
    exp: "콩이 들어가지만 큰 도시",
  },
  {
    qst: "돌잔치를 영어로?",
    ans: "락페스티벌",
    exp: "락(rock, 돌) + 페스티벌(festival, 잔치)",
  },
  {
    qst: "칼이 정색하면?",
    ans: "검정색",
    exp: "검(칼) + 정색",
  },
];

export { data };
